nozzle/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object	U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField #codeStream //Use codeStream to set the value of the initial conditions
{
    codeInclude
    #{
        #include "fvCFD.H"
        #include "math.h"
    #};
    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};
    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};
    //Depending of what are you trying to do, you will need to add new files, options and libraries.
    //For most of the cases, this part is always the same.

    code //Insert your code here. At this point, you need to know how to access internal mesh information
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
	const vectorField& CC = mesh.C(); //cell center 

	const scalar U_M = 10;
	const scalar U_m = 1;
	const scalar R = .1;
	const scalar h = 15*R;
	vectorField U(mesh.nCells(), vector(0,0,0));
        forAll(U, i)
        {
		// Access cell centers coordinates
		const scalar y = CC[i].y();
		const scalar z = CC[i].z();
		const scalar a =(y*y+z*z)/R/R;
		if (a<1) {
			U[i][0] = U_M*tanh(4*(1-a));
		}
		else if ((a>1) && (a<pow(h/R,2))) {
			U[i][0] = U_m*tanh(4*(a-1));
		}
		else {
			U[i][0] = U_m;
		}
        }
        U.writeEntry("", os);
    #};
};;

boundaryField
{
    inlet
    {
	type codedFixedValue;
	value uniform (0 0 0);
	name inletLaminarProfile;
	
	codeInclude
	#{
		#include "math.h"
	#};

	code
	#{
		const fvPatch& boundaryPatch = patch();
		const vectorField& Cf = boundaryPatch.Cf();
		const scalar U_M = 10;
		const scalar R = .1;
		forAll(Cf, faceI) {
			const scalar y = Cf[faceI].y();
			const scalar z = Cf[faceI].z();
			const scalar a = (y*y+z*z)/R/R;
			(*this)[faceI] = vector(U_M*tanh(4*(1-a)),0,0);
		}
	#};
    }

    front
    {
        type wedge;
    }

    back
    {
        type wedge;
    }

    wall
    {
        type noSlip;
    }

    coflow
    {
	type codedFixedValue;
	value uniform (0 0 0);
	name coflowLaminarProfile;
	
	codeInclude
	#{
		#include "math.h"
	#};

	code
	#{
		const fvPatch& boundaryPatch = patch();
		const vectorField& Cf = boundaryPatch.Cf();
		const scalar U_m = 1;
		const scalar R = .1;
		forAll(Cf, faceI) {
			const scalar y = Cf[faceI].y();
			const scalar z = Cf[faceI].z();
			const scalar a = (y*y+z*z)/R/R;
			(*this)[faceI] = vector(U_m*tanh(4*(a-1)),0,0);
		}
	#};
    }

    far
    {
        type fixedValue;
        value uniform (1 0 0);
    }

    outlet
    {
	type zeroGradient;
    }

}

// ************************************************************************* //
