nozzle/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-6;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue $internalField;
    }

    coflow
    {
        type            freestream;
        freestreamValue $internalField;
    }

    far
    {
        type            freestream;
        freestreamValue $internalField;
    }

    outlet
    {
        type            freestream;
        freestreamValue $internalField;
    }

    wall
    {
        type            fixedValue;
        value           uniform 0;  
    }

    front
    {
        type wedge;
    }

    back
    {
        type wedge;
    }
    
}

// ************************************************************************* //
