nozzle/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];

internalField uniform 1e5;

boundaryField
{

    inlet
    {
        type zeroGradient;
    }

    front
    {
        type wedge;
    }

    back
    {
        type wedge;
    }

    wall
    {
        type zeroGradient;
    }

    coflow
    {
        type fixedValue;
        value $internalField;
    }

    far
    {
        type fixedValue;
        value $internalField;
    }

    outlet
    {
	type fixedValue;
        value $internalField;
    }
}

// ************************************************************************* //
