nozzle/Allrun
#!/bin/sh
./Allclean
./Generatemesh
./Computationrun
