nozzle/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          .01;
    }

    "(U|nuTilda)"
    {
        solver          smoothSolver;
        smoother  	GaussSeidel;
	nSweeps	2;
        tolerance       1e-8;
        relTol          .1;
    }
}

SIMPLE
{
    residualControl
    {
        p               1e-5;
        U               1e-5;
        nuTilda         1e-5;
    }

    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
        p               .5;
    }
    equations
    {
        U               .7;
        nuTilda    	.7;
    }
}


// ************************************************************************* //
